/* 나쁜 코드에 주석을 달지마라. 새로 짜라. */

/**
 * 좋은 주석
 * 1. 법적인 주석 (저작권이나 계약조건을 머리에 써두는..)
 * 2. 정보를 제공하는 주석
 * 3. 내가 왜 이렇게 했는지 의도를 설명하는 주석
 * 4. 의미를 명료하게 밝히는 주석
 * 5. 결과를 경고하는 주석
 * 6. TODO 주석 (앞으로의 해야할 일을 적어둠)
 * 7. 중요성을 강조하는 주석
 *  */

/**
 * 나쁜 주석
 * 1. 주절거리는 주석 (저자만 의도 파악이 가능한 주석)
 * 2. 같은 이야기를 중복하는 주석
 * 3. 오해할 여지가 있는 주석
 * 4. 의무적으로 다는 주석 (example : jsdocs)
 * 5. 이력을 기록하는 주석 (이젠 버전관리 프로그램이 있어서 필요없다)
 * 6. 있으나마나한 주석 (너무 당연한 소리를 써놓지 말기)
 * 7. 함수나 변수로 표현할 수 있다면 주석을 달지 마라
 * 8. 위치를 표현하는 주석 ///////////////////////////// <= 이런거
 * 9. 함수를 닫는 곳에 다는 주석
 * 10. 공로를 돌리거나 저자를 표시하는 주석 ( /* 김재원이 추가함  *) <= 이런거
 * 11. 코드를 주석처리 (이건 이유가 있어서 주석해놨겠지..란 생각때문에 남겨두다가 쌓임)
 * 12. 전역 정보 (주석은 설명이 필요한 코드 바로 위에 달아야 한다)
 * 13. 쓸데없이 많은 정보 (흥미로운 역사나 관련없는 정보)
 * 14. 모호한 관계 (주석과 주석이 필요한 코드사이의 관계가 명백해야한다)
 * 15. 비공개 코드에서의 jsdocs
 *  */
